package homework.lucky_dumpling;
// Задача про поиск "счастливого пельменя".
// Часть 1.
// Хозяйка налепила для гостей 30 пельменей, каждый весом от 25 до 35 грамм.
// Напишите программу, которая занесет в массив данные о весе каждого слепленного пельменя.
// Часть 2.
// Хозяйка налепила для гостей 30 пельменей. В один из пельменей она положила монету,
// которая увеличивает вес пельменя на 15 грамм.
// Напишите программу, которая ищет счастливый пельмень.

public class LuckyDampling {
    public static void main(String[] args) {
        // массив на 30 пельменей с весом от 25 до 35 грамм


        // задумываем номер счастливого пельменя


        // увеличиваем массу этого пельменя на 15 грамм


        // ищем в массиве "тяжелый" пельмень


    }
}
